# ДЗ 5.2. Модифікувати калькулятор
# Модифікувати калькулятор таким чином, щоб він працював доти,
# доки користувач цього хоче. Тобто, потрібно робити запит
# до користувача на продовження роботи калькулятора після кожного обчислення -
# якщо користувач ввів yes (можна просто y), то нове обчислення, інакше - закінчення роботи.
print("Модифікований калькулятор")
while True:
    number1 = int(input("Внесіть перший операнд(a): "))
    number2 = int(input("Внесіть другий операнд(b): "))
    operator = int(input("Виберіть дію\n1. Додати a+b\n2. Відняти a-b\n3. Помножити a*b\n4. Розділити a/b\n"))
    if operator == 1:
        print('Результат', number1 + number2)
    elif operator == 2:
        print('Результат', number1 - number2)
    elif operator == 3:
           print('Результат', number1 * number2)
    elif operator == 4 and number2 != 0:
        print('Результат', number1 / number2)
    else:
        if number2 == 0:
            print("На нуль ділити не можна")
        else:
            print("Обрана не правильна дія")
    print("Для закінчення роботи введіть 1 . Продовжити будь що інше або просто Ентер")
    d = input()
    if d == "1": break
print("Роботу закінчено!")